# Many examples, great organization, etc: 
# https://github.com/joelparkerhenderson/brewfile/blob/master/Brewfile

cask_args appdir: '/Applications'

# Taps
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "caskroom/cask"
tap "caskroom/versions"

# Bash stuff
brew "coreutils", args: [ "--with-default-names" ]
brew "moreutils"
brew "findutils", args: [ "--with-default-names" ]
brew "gnu-sed", args: [ "--with-default-names" ]
brew "bash"
brew "bash-completion2"

# Binaries
brew "ansible"
brew "bat"
brew "dnsmasq"
brew "dos2unix"
brew "exa"
brew "git"
brew "gnupg2"
brew "go"
brew "grep", args: [ "--with-default-names" ]
brew "hstr"
brew "htop"
brew "jq"
brew "openssh"
brew "openssl"
brew "pcre"
brew "perl"
brew "speedtest_cli"
brew "tmux"
brew "tree"
brew "unzip"
brew "vim"
brew "watch"
brew "wget", args: [ "--enable-iri" ]
brew "youtube-dl"

# Apps
cask "alfred"
cask "appcleaner"
cask "authy"
cask "bartender"
cask "bettertouchtool"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "hammerspoon"
cask "insomnia"
cask "istat-menus"
cask "iterm2"
cask "karabiner"
cask "macpass"
cask "minikube"
cask "minishift"
cask "postman"
cask "powershell"
cask "scroll-reverser"
cask "sharemouse"
cask "signal"
cask "station"
cask "the-unarchiver"
cask "visual-studio-code"
cask "vlc"
cask "witch"

# Quicklooks
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"

# Fonts
cask "font-lato"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro-for-powerline"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"

# Java -- note that Groovy has to be installed after Java
brew "jenv"
brew "groovy"

# Android dev stuff
## See more here: https://gist.github.com/agrcrobles/165ac477a9ee51198f4a870c723cd441
cask "android-platform-tools"


# Docker stuff
brew "docker"
brew "docker-compose"
brew "docker-machine-driver-xhyve"

# Docker image inspection - https://github.com/wagoodman/dive
tap "wagoodman/dive"
brew "dive"

# A command to download mac app store apps
# http://www.softantenna.com/wp/mac/mas-cli
# https://github.com/argon/mas
tap "argon/mas"
brew "mas"

# Download apps later -- currently bugged, doesn't work in Mojave
# mas 'OneDrive', id: 823766827
mas 'LastPass Password Manager', id: 926036361
mas 'Magnet', id: 441258766
